Revit 2026 API

# ColorFillSchemeRemoveEntry Method

---

Removes an entry whose parameter value is the same as the input from the scheme

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveEntry(
	ColorFillSchemeEntry entry
)
```
```vb
Public Sub RemoveEntry (
	entry As ColorFillSchemeEntry
)
```
```cpp
public:
void RemoveEntry(
	ColorFillSchemeEntry^ entry
)
```
```fsharp
member RemoveEntry :
        entry : ColorFillSchemeEntry -> unit
```

#### Parameters

entry ColorFillSchemeEntry
     The entry to remove.

| Exception | Condition |
| --- | --- |
| ArgumentException | The entry cannot be removed from the scheme. |
| ArgumentNullException | A non-optional argument was null |

The entry can not be removed if it is in use.

#### Reference

ColorFillScheme Class

Autodesk.Revit.DB Namespace